In [1]:
import pandas as pd
import numpy as np

### Series

In [3]:
a1=pd.Series([11,21,31,22,13])
a1

0    11
1    21
2    31
3    22
4    13
dtype: int64

In [5]:
#adding the index
a2=pd.Series([34,21,32,11,23],index=["a","b","c","d","e"])
a2

a    34
b    21
c    32
d    11
e    23
dtype: int64

In [6]:
a2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
a2["c"]

32

In [8]:
a2[["c","d","a"]]

c    32
d    11
a    34
dtype: int64

In [9]:
a2["a":"c"]

a    34
b    21
c    32
dtype: int64

In [12]:
#creating the series using dict
d1={"name":"nidhisha","age":23,"gender":"f","caste":"jain"}
a3=pd.Series(d1)
a3

name      nidhisha
age             23
gender           f
caste         jain
dtype: object

In [14]:
a3.index.name="details"

In [15]:
a3

details
name      nidhisha
age             23
gender           f
caste         jain
dtype: object

In [5]:
#creating the series from tuple
t1=(3,2,1,4,2,3)
a4=pd.Series(t1,index=("a","b","c","d","e","f"))
a4

a    3
b    2
c    1
d    4
e    2
f    3
dtype: int64

In [32]:
ID=list(range(11,31))
SL=[5.1,4,9,4.7,6.0,4.0,3.6,5.2,5.3,5.7,4.7,3.9,4.0,3.8,4.1,4.9,5.9,4.3,5.4,3.5]
PL = [5.0,4,3,3.7,4.6,7.1,4.5,5.4,5.1,2.7,3.2,3.1,3.2,3.7,5.3,3.8,5.9,4.3,5.4,7.1]
species = ["Iris verginica","iris setosa","Iris verginica","iris vercicolor","iris setosa","iris setosa","iris setosa",
"iris vercicolor","iris vercicolor","Iris verginica","Iris verginica","iris setosa",
"iris setosa","Iris verginica",
"iris vercicolor","iris vercicolor","iris vercicolor","Iris verginica","Iris verginica","iris setosa"]

iris=pd.Series({"id":ID,"sl":SL,"pl":PL,"species":species})
print(iris)

id         [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 2...
sl         [5.1, 4, 9, 4.7, 6.0, 4.0, 3.6, 5.2, 5.3, 5.7,...
pl         [5.0, 4, 3, 3.7, 4.6, 7.1, 4.5, 5.4, 5.1, 2.7,...
species    [Iris verginica, iris setosa, Iris verginica, ...
dtype: object

### Dataframe

In [33]:
#convert above series into data frame
df=pd.DataFrame(dict(iris)).reset_index()
df

    index  id   sl   pl          species
0       0  11  5.1  5.0   Iris verginica
1       1  12  4.0  4.0      iris setosa
2       2  13  9.0  3.0   Iris verginica
3       3  14  4.7  3.7  iris vercicolor
4       4  15  6.0  4.6      iris setosa
5       5  16  4.0  7.1      iris setosa
6       6  17  3.6  4.5      iris setosa
7       7  18  5.2  5.4  iris vercicolor
8       8  19  5.3  5.1  iris vercicolor
9       9  20  5.7  2.7   Iris verginica
10     10  21  4.7  3.2   Iris verginica
11     11  22  3.9  3.1      iris setosa
12     12  23  4.0  3.2      iris setosa
13     13  24  3.8  3.7   Iris verginica
14     14  25  4.1  5.3  iris vercicolor
15     15  26  4.9  3.8  iris vercicolor
16     16  27  5.9  5.9  iris vercicolor
17     17  28  4.3  4.3   Iris verginica
18     18  29  5.4  5.4   Iris verginica
19     19  30  3.5  7.1      iris setosa

In [41]:
df=pd.DataFrame(dict(iris),columns=["pl","sl","species"],index=iris["id"])
df.head(5)

     pl   sl          species
11  5.0  5.1   Iris verginica
12  4.0  4.0      iris setosa
13  3.0  9.0   Iris verginica
14  3.7  4.7  iris vercicolor
15  4.6  6.0      iris setosa

In [42]:
df["species"]

11     Iris verginica
12        iris setosa
13     Iris verginica
14    iris vercicolor
15        iris setosa
16        iris setosa
17        iris setosa
18    iris vercicolor
19    iris vercicolor
20     Iris verginica
21     Iris verginica
22        iris setosa
23        iris setosa
24     Iris verginica
25    iris vercicolor
26    iris vercicolor
27    iris vercicolor
28     Iris verginica
29     Iris verginica
30        iris setosa
Name: species, dtype: object

In [43]:
df.species

11     Iris verginica
12        iris setosa
13     Iris verginica
14    iris vercicolor
15        iris setosa
16        iris setosa
17        iris setosa
18    iris vercicolor
19    iris vercicolor
20     Iris verginica
21     Iris verginica
22        iris setosa
23        iris setosa
24     Iris verginica
25    iris vercicolor
26    iris vercicolor
27    iris vercicolor
28     Iris verginica
29     Iris verginica
30        iris setosa
Name: species, dtype: object

In [73]:
#want to retrive a row
#can call by index using loc
df.loc[23]

pl                 3.2
sl                 4.0
species    iris setosa
count             12.0
Name: 23, dtype: object

In [74]:
df.head(3)

     pl   sl         species  count
11  5.0  5.1  Iris verginica    0.0
12  4.0  4.0     iris setosa    1.0
13  3.0  9.0  Iris verginica    2.0

In [75]:
df["count"]=np.arange(20.0)
df

     pl   sl          species  count
11  5.0  5.1   Iris verginica    0.0
12  4.0  4.0      iris setosa    1.0
13  3.0  9.0   Iris verginica    2.0
14  3.7  4.7  iris vercicolor    3.0
15  4.6  6.0      iris setosa    4.0
16  7.1  4.0      iris setosa    5.0
17  4.5  3.6      iris setosa    6.0
18  5.4  5.2  iris vercicolor    7.0
19  5.1  5.3  iris vercicolor    8.0
20  2.7  5.7   Iris verginica    9.0
21  3.2  4.7   Iris verginica   10.0
22  3.1  3.9      iris setosa   11.0
23  3.2  4.0      iris setosa   12.0
24  3.7  3.8   Iris verginica   13.0
25  5.3  4.1  iris vercicolor   14.0
26  3.8  4.9  iris vercicolor   15.0
27  5.9  5.9  iris vercicolor   16.0
28  4.3  4.3   Iris verginica   17.0
29  5.4  5.4   Iris verginica   18.0
30  7.1  3.5      iris setosa   19.0

In [76]:
#then you are assigning lists or arrays to a column, the value’s length must match the
#length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
#the DataFrame’s index, inserting missing values in any holes:
df["other"]=pd.Series(["sidhi",3,4],index=[18,23,14])

In [77]:
df

     pl   sl          species  count  other
11  5.0  5.1   Iris verginica    0.0    NaN
12  4.0  4.0      iris setosa    1.0    NaN
13  3.0  9.0   Iris verginica    2.0    NaN
14  3.7  4.7  iris vercicolor    3.0      4
15  4.6  6.0      iris setosa    4.0    NaN
16  7.1  4.0      iris setosa    5.0    NaN
17  4.5  3.6      iris setosa    6.0    NaN
18  5.4  5.2  iris vercicolor    7.0  sidhi
19  5.1  5.3  iris vercicolor    8.0    NaN
20  2.7  5.7   Iris verginica    9.0    NaN
21  3.2  4.7   Iris verginica   10.0    NaN
22  3.1  3.9      iris setosa   11.0    NaN
23  3.2  4.0      iris setosa   12.0      3
24  3.7  3.8   Iris verginica   13.0    NaN
25  5.3  4.1  iris vercicolor   14.0    NaN
26  3.8  4.9  iris vercicolor   15.0    NaN
27  5.9  5.9  iris vercicolor   16.0    NaN
28  4.3  4.3   Iris verginica   17.0    NaN
29  5.4  5.4   Iris verginica   18.0    NaN
30  7.1  3.5      iris setosa   19.0    NaN

In [80]:
#want to delete the column other
del df["other"]

In [81]:
df.head(2)

     pl   sl         species  count
11  5.0  5.1  Iris verginica    0.0
12  4.0  4.0     iris setosa    1.0

In [84]:
#nested dict
pop={"India":{2000:30,2005:90,2010:110},
    "USA":{2000:10,2005:50},
    "UK":{2000:5,2005:40,2010:90}}   #outer key values in considered as columns and inner key is row indices
df1=pd.DataFrame(pop)
df1

      India   USA  UK
2000     30  10.0   5
2005     90  50.0  40
2010    110   NaN  90

In [85]:
df1.T

       2000  2005   2010
India  30.0  90.0  110.0
USA    10.0  50.0    NaN
UK      5.0  40.0   90.0

In [91]:
#providing the column name and row name
df1.index.name="year"
df1.columns.name="country"

In [92]:
df1

country  India   USA  UK
year
2000        30  10.0   5
2005        90  50.0  40
2010       110   NaN  90

### Index objects

In [95]:
labels=pd.Index(np.arange(4))
s1=pd.Series(["a","b","c","d"],index=labels)
s1

0    a
1    b
2    c
3    d
dtype: object

In [97]:
labels=pd.Index(["a","a","b","a"])
s2=pd.Series(np.arange(4),index=labels)
s2

a    0
a    1
b    2
a    3
dtype: int32

In [98]:
s2["a"]

a    0
a    1
a    3
dtype: int32

### reindex

In [99]:
obj=pd.Series(np.arange(4),index=["c","b","a","d"])
obj

c    0
b    1
a    2
d    3
dtype: int32

In [100]:
#reindex row
obj2=obj.reindex(["a","b","c","d","e"])

In [101]:
obj2

a    2.0
b    1.0
c    0.0
d    3.0
e    NaN
dtype: float64

In [112]:
#like wise can change the column also
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","c","d","e"],columns=["India","pakisthan","shrilanka","USA"])
df

   India  pakisthan  shrilanka  USA
a      0          1          2    3
c      4          5          6    7
d      8          9         10   11
e     12         13         14   15

In [115]:
df1=df.reindex(index=["a","b","c","d","e"],columns=["India","UK","shrilanka","USA"])
df1

   India  UK  shrilanka   USA
a    0.0 NaN        2.0   3.0
b    NaN NaN        NaN   NaN
c    4.0 NaN        6.0   7.0
d    8.0 NaN       10.0  11.0
e   12.0 NaN       14.0  15.0

In [118]:
df2=df.loc[["a","c","d","e"]]
df2

   India  pakisthan  shrilanka  USA
a      0          1          2    3
c      4          5          6    7
d      8          9         10   11
e     12         13         14   15

### droping the entries

In [121]:
s1=pd.Series(np.arange(4),index=["a","b","c","d"])
s1

a    0
b    1
c    2
d    3
dtype: int32

In [125]:
s2=s1.drop("c")
s2

a    0
b    1
d    3
dtype: int32

In [127]:
s3=s1.drop(["c","d"])
s3

a    0
b    1
dtype: int32

In [128]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","b","c","d"], columns=["India","UK","shrilanka","USA"])
df

   India  UK  shrilanka  USA
a      0   1          2    3
b      4   5          6    7
c      8   9         10   11
d     12  13         14   15

In [135]:
#droping the single column
droped_df=df.drop(columns=["shrilanka"])
droped_df

   India  UK  USA
a      0   1    3
b      4   5    7
c      8   9   11
d     12  13   15

In [137]:
# droping the multiple column
drop_df=df.drop(columns=["USA","UK"])
drop_df

   India  shrilanka
a      0          2
b      4          6
c      8         10
d     12         14

In [139]:
#drop the multiplr row
drop_rows=df.drop(index=["a","c"])
drop_rows

   India  UK  shrilanka  USA
b      4   5          6    7
d     12  13         14   15

In [140]:
# by using the axis
drop_row=df.drop(["c","a"],axis=0)
drop_row

   India  UK  shrilanka  USA
b      4   5          6    7
d     12  13         14   15

In [141]:
drop_col=df.drop(["USA"],axis=1)
drop_col

   India  UK  shrilanka
a      0   1          2
b      4   5          6
c      8   9         10
d     12  13         14

### indexing,selection and filtering

In [9]:
df=pd.Series(np.arange(5),index=["a","b","c","d","e"])
df

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [10]:
df["a"]

0

In [11]:
df[["a","c","d"]]

a    0
c    2
d    3
dtype: int32

In [12]:
df[2:4]

c    2
d    3
dtype: int32

In [13]:
df[df<3]

a    0
b    1
c    2
dtype: int32

### dataframe of indexing,slicing,boolean

In [100]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","b","c","d"],columns=["india","uk",'usa','germany'])
df

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11
d     12  13   14       15

In [3]:
df["india"]

a     0
b     4
c     8
d    12
Name: india, dtype: int32

In [4]:
df[["uk","usa"]]

   uk  usa
a   1    2
b   5    6
c   9   10
d  13   14

In [5]:
df[:3]

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11

In [6]:
df[df["uk"]>2]["uk"]

b     5
c     9
d    13
Name: uk, dtype: int32

In [7]:
df[2:4]

   india  uk  usa  germany
c      8   9   10       11
d     12  13   14       15

## loc and iloc
loc and iloc. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc)

In [8]:
df.loc["a",["uk","usa"]]

uk     1
usa    2
Name: a, dtype: int32

In [9]:
df.iloc[0,[1,2]]

uk     1
usa    2
Name: a, dtype: int32

In [10]:
df.loc["a":"c",["india"]]   #last mentioned index is inclusive

   india
a      0
b      4
c      8

In [11]:
df.iloc[0:3,0]

a    0
b    4
c    8
Name: india, dtype: int32

In [12]:
df

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11
d     12  13   14       15

In [13]:
#want to return the rows having greater than 3 but last 3 columns value
df.iloc[:,-3:][df.germany>5]

   uk  usa  germany
b   5    6        7
c   9   10       11
d  13   14       15

### Arithmetic and data alignment

In [14]:
s1=pd.Series(np.arange(1,6),index=list("adcef"))
print(s1)
s2=pd.Series(np.arange(11,16),index=list("abcdg"))
print(s2)

a    1
d    2
c    3
e    4
f    5
dtype: int32
a    11
b    12
c    13
d    14
g    15
dtype: int32

In [15]:
add=s1+s2
add

a    12.0
b     NaN
c    16.0
d    16.0
e     NaN
f     NaN
g     NaN
dtype: float64

In [16]:
df1=pd.DataFrame(np.random.randint(11,30,(9,5)),index=list("abcdfghij"),columns=["ind","kor","jan","ger","aut"])
print(df1.head(2))
df2=pd.DataFrame(np.random.randint(41,80,(9,5)),index=list("acdefghij"),columns=["ind","kor","jan","uk","aut"])
print(df2.head(2))

   ind  kor  jan  ger  aut
a   26   21   16   22   26
b   17   23   16   13   25
   ind  kor  jan  uk  aut
a   53   66   43  65   57
c   49   66   61  57   68

In [17]:
add=df1+df2
add              #adding the two dataframe by union method

     aut  ger   ind   jan   kor  uk
a   83.0  NaN  79.0  59.0  87.0 NaN
b    NaN  NaN   NaN   NaN   NaN NaN
c   90.0  NaN  67.0  83.0  94.0 NaN
d   80.0  NaN  87.0  83.0  96.0 NaN
e    NaN  NaN   NaN   NaN   NaN NaN
f   85.0  NaN  84.0  80.0  86.0 NaN
g   67.0  NaN  81.0  94.0  97.0 NaN
h   93.0  NaN  66.0  96.0  56.0 NaN
i  100.0  NaN  81.0  67.0  70.0 NaN
j   70.0  NaN  87.0  79.0  84.0 NaN

In [18]:
df1.add(df2,fill_value=0)

     aut   ger   ind   jan   kor    uk
a   83.0  22.0  79.0  59.0  87.0  65.0
b   25.0  13.0  17.0  16.0  23.0   NaN
c   90.0  15.0  67.0  83.0  94.0  57.0
d   80.0  11.0  87.0  83.0  96.0  68.0
e   47.0   NaN  50.0  72.0  53.0  71.0
f   85.0  22.0  84.0  80.0  86.0  72.0
g   67.0  27.0  81.0  94.0  97.0  55.0
h   93.0  29.0  66.0  96.0  56.0  52.0
i  100.0  12.0  81.0  67.0  70.0  55.0
j   70.0  26.0  87.0  79.0  84.0  52.0

In [19]:
df1=pd.DataFrame(np.arange(12).reshape(4,3))
df1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [20]:
df2=df1.iloc[0,:]
df2

0    0
1    1
2    2
Name: 0, dtype: int32

In [21]:
sub=df1-df2
sub

   0  1  2
0  0  0  0
1  3  3  3
2  6  6  6
3  9  9  9

In [22]:
#If an index value is not found in either the DataFrame’s columns or the Series’s index,
#the objects will be reindexed to form the union

In [23]:
df1=pd.DataFrame(np.arange(12).reshape(4,3))
df1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [24]:
df2=df1[0]

In [25]:
sub=df1-df2
sub

   0  1  2   3
0  0 -2 -4 NaN
1  3  1 -1 NaN
2  6  4  2 NaN
3  9  7  5 NaN

In [26]:
df1=pd.DataFrame(np.arange(12).reshape(4,3))
df2=df1[0]
df1.sub(df2,axis=0)  # based on index means in both df finds the same index

   0  1  2
0  0  1  2
1  0  1  2
2  0  1  2
3  0  1  2

In [27]:
f=lambda x:x.max()-x.min()

In [28]:
df

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11
d     12  13   14       15

In [29]:
df.apply(f)

india      12
uk         12
usa        12
germany    12
dtype: int64

In [30]:
def square(x):
    return x**2

In [31]:
df["square_uk"]=df["uk"].apply(square)

In [32]:
df

   india  uk  usa  germany  square_uk
a      0   1    2        3          1
b      4   5    6        7         25
c      8   9   10       11         81
d     12  13   14       15        169

In [33]:
df1=df.drop(columns=["square_uk"])

In [49]:
sample=df1.copy()

In [50]:
#want to create a data which contain max and min valueof sample of each column

In [51]:
def sample_list(x):
    return pd.Series([x.max(),x.min()],index=["max","min"])

In [52]:
max_min=sample.apply(sample_list)
max_min

     india  uk  usa  germany
max     12  13   14       15
min      0   1    2        3

In [53]:
f=lambda x: "%.2f" % x

In [56]:
df=df.applymap(f)
df

   india     uk    usa germany
a   0.00   1.00   2.00    3.00
b   4.00   5.00   6.00    7.00
c   8.00   9.00  10.00   11.00
d  12.00  13.00  14.00   15.00

### sorting and ranking

In [64]:
s1=pd.Series(np.array([4,3,8,6,1]),index=["d","a","e",'b',"c"])
s1

d    4
a    3
e    8
b    6
c    1
dtype: int32

In [65]:
s1.sort_index()         #sort the index based on that index value will sort

a    3
b    6
c    1
d    4
e    8
dtype: int32

In [70]:
sorted_df=df.sort_index()   #it will sort an index based on axis=0
sorted_df

   india     uk    usa germany
a   0.00   1.00   2.00    3.00
b   4.00   5.00   6.00    7.00
c   8.00   9.00  10.00   11.00
d  12.00  13.00  14.00   15.00

In [72]:
#want to sort the column
sorted_df=df.sort_index(axis=1)
sorted_df

  germany  india     uk    usa
a    3.00   0.00   1.00   2.00
b    7.00   4.00   5.00   6.00
c   11.00   8.00   9.00  10.00
d   15.00  12.00  13.00  14.00

In [74]:
#want to sort in the decending order
sorted_df=df.sort_index()[::-1]
sorted_df

   india     uk    usa germany
d  12.00  13.00  14.00   15.00
c   8.00   9.00  10.00   11.00
b   4.00   5.00   6.00    7.00
a   0.00   1.00   2.00    3.00

In [75]:
sorted_df=df.sort_index(ascending=False)
sorted_df

   india     uk    usa germany
d  12.00  13.00  14.00   15.00
c   8.00   9.00  10.00   11.00
b   4.00   5.00   6.00    7.00
a   0.00   1.00   2.00    3.00

In [76]:
sorted_df=df.sort_index(axis=1,ascending=False)
sorted_df

     usa     uk  india germany
a   2.00   1.00   0.00    3.00
b   6.00   5.00   4.00    7.00
c  10.00   9.00   8.00   11.00
d  14.00  13.00  12.00   15.00

In [ ]:
#if contains any missing value, it will be sorted in the last.

In [101]:
#sort the values
df=pd.DataFrame(np.random.randint(10,50,(6,6)),index=list("abcdef"),columns=["ind","uk","usa",'pak',"ger","kor"])
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

In [82]:
df.sort_values(by="ind")   # only sort the value by columns wise

   ind  uk  usa  pak  ger  kor
d   15  43   19   25   47   45
c   23  23   38   42   47   13
e   24  14   16   17   43   41
f   25  18   24   26   31   38
b   39  11   27   26   23   28
a   43  38   14   14   10   47

In [84]:
df.sort_values(by=["pak","ger"])

   ind  uk  usa  pak  ger  kor
a   43  38   14   14   10   47
e   24  14   16   17   43   41
d   15  43   19   25   47   45
b   39  11   27   26   23   28
f   25  18   24   26   31   38
c   23  23   38   42   47   13

In [90]:
# rank

In [88]:
rank_series=s1.rank()
rank_series

d    3.0
a    2.0
e    5.0
b    4.0
c    1.0
dtype: float64

In [91]:
s1["f"]=4
s1

d    4
a    3
e    8
b    6
c    1
f    4
dtype: int64

In [92]:
rank_series=s1.rank()       #it assign the mean for tie values
rank_series

d    3.5
a    2.0
e    6.0
b    5.0
c    1.0
f    3.5
dtype: float64

In [93]:
#want to assign the max for an tie value
rank_s1=s1.rank(method='max')
rank_s1

d    4.0
a    2.0
e    6.0
b    5.0
c    1.0
f    4.0
dtype: float64

In [95]:
#want to assign the rank in decsending order
rank_s1=s1.rank(method='average',ascending=False)
rank_s1

d    3.5
a    5.0
e    1.0
b    2.0
c    6.0
f    3.5
dtype: float64

In [110]:
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

In [111]:
df_rank=df.rank()
df_rank

   ind   uk  usa  pak  ger  kor
a  1.0  1.0  6.0  5.0  2.0  1.0
b  3.0  2.0  4.0  3.0  3.0  2.0
c  2.0  4.5  3.0  4.0  5.0  5.0
d  5.0  3.0  2.0  1.5  6.0  3.0
e  4.0  4.5  1.0  6.0  4.0  6.0
f  6.0  6.0  5.0  1.5  1.0  4.0

In [112]:
df_rank=df.rank(axis=1)
df_rank

   ind   uk  usa  pak  ger  kor
a  1.5  3.0  6.0  5.0  4.0  1.5
b  3.0  4.0  6.0  5.0  2.0  1.0
c  1.5  6.0  3.0  4.0  5.0  1.5
d  4.0  5.0  3.0  2.0  6.0  1.0
e  2.0  4.0  1.0  6.0  3.0  5.0
f  6.0  5.0  4.0  3.0  1.0  2.0

### axis indexes and duplicates lables

In [114]:
s2=pd.Series(np.arange(6),index=["a","a","b","b","c","d"])
s2

a    0
a    1
b    2
b    3
c    4
d    5
dtype: int32

In [118]:
s2.index.is_unique

False

In [122]:
df2=pd.DataFrame(np.arange(12).reshape(4,3),index=["a","a","b","b"])
df2

   0   1   2
a  0   1   2
a  3   4   5
b  6   7   8
b  9  10  11

In [123]:
df2.index.is_unique

False

In [129]:
df2.loc["b"]

   0   1   2
b  6   7   8
b  9  10  11

In [130]:
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

### mathematical and statistical methods

In [133]:
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

In [132]:
df["ind"].corr(df["uk"])

0.7396706630864726

In [134]:
df["uk"].cov(df["usa"])

-48.400000000000006

In [135]:
df.cov()

            ind          uk    usa   pak    ger         kor
ind  155.366667  107.466667    9.2 -61.6  -24.3   -3.333333
uk   107.466667  135.866667  -48.4  -3.8   10.2   66.466667
usa    9.200000  -48.400000  140.8 -45.2  -69.6 -123.600000
pak  -61.600000   -3.800000  -45.2  88.4  -15.2   90.600000
ger  -24.300000   10.200000  -69.6 -15.2  164.3    0.600000
kor   -3.333333   66.466667 -123.6  90.6    0.6  164.666667

In [147]:
df["ind"].unique()

array([10, 18, 17, 26, 20, 46])

In [151]:
pd.value_counts(df.values,sort=False)

TypeError: No matching signature found

In [152]:
d1={"id":np.arange(10),"data":[12,43,1,2,1,21,21,2,1,6]}
s1=pd.Series(d1)
s1

id          [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
data    [12, 43, 1, 2, 1, 21, 21, 2, 1, 6]
dtype: object

In [153]:
df1=pd.DataFrame(dict(s1))
df1

   id  data
0   0    12
1   1    43
2   2     1
3   3     2
4   4     1
5   5    21
6   6    21
7   7     2
8   8     1
9   9     6

In [154]:
df=pd.DataFrame(np.random.randint(10,50,(9,5)),index=list("abcdefghi"),columns=list("ABCDE"))
df

    A   B   C   D   E
a  25  15  10  26  44
b  28  17  18  39  11
c  23  21  17  12  48
d  11  46  43  28  28
e  29  21  21  26  38
f  18  14  45  37  16
g  47  33  16  40  26
h  22  14  26  26  22
i  31  31  36  19  46

In [155]:
#remane the columns
df=df.rename(columns={"A":"uk","B":"usa","C":"ind","D":"kor","E":"jan"})
df

   uk  usa  ind  kor  jan
a  25   15   10   26   44
b  28   17   18   39   11
c  23   21   17   12   48
d  11   46   43   28   28
e  29   21   21   26   38
f  18   14   45   37   16
g  47   33   16   40   26
h  22   14   26   26   22
i  31   31   36   19   46

In [156]:
df["kor"]

a    26
b    39
c    12
d    28
e    26
f    37
g    40
h    26
i    19
Name: kor, dtype: int32

In [157]:
df.loc[["a","c","h"],["uk","usa"]]

   uk  usa
a  25   15
c  23   21
h  22   14

In [160]:
df.loc["a":"d",["usa","ind"]]

   usa  ind
a   15   10
b   17   18
c   21   17
d   46   43

In [161]:
df["usa"][:4]

a    15
b    17
c    21
d    46
Name: usa, dtype: int32

In [162]:
df[:4]["usa"]

a    15
b    17
c    21
d    46
Name: usa, dtype: int32